Tekla Open API Reference for Tekla Structures 2025
ChangeData Properties
The ChangeData type exposes the following members.
Properties
Name | Description
Object
 Gets the changed object.
Source
 Gets the change source type.
Type
 Gets the change type.
Top
See Also
Reference
ChangeData Class
Tekla.Structures.Model Namespace